Actualizaciones graficas
